#!/bin/bash

# پیام خوش‌آمدگویی
echo "Welcome to the IPv4 Random Generator!"

# اجرای اسکریپت پایتون
python3 - <<'END'
import ipaddress
import random

# تعریف لیست رنج‌های IP
ip_ranges = [
    ("77.223.128.0", "77.223.159.255"),
    ("78.40.224.0", "78.40.231.255"),
    ("78.111.97.0", "78.111.98.255"),
    ("78.156.160.0", "78.156.191.255"),
    ("82.153.211.0", "82.153.211.255"),
    ("83.136.144.0", "83.136.147.255"),
    ("85.31.125.0", "85.31.125.255"),
    ("85.95.224.0", "85.95.228.255"),
    ("91.108.188.0", "91.108.188.255"),
    ("93.177.100.0", "93.177.103.255"),
    ("103.205.180.0", "103.205.181.255"),
    ("128.77.19.0", "128.77.19.255"),
    ("137.174.84.0", "137.174.84.255"),
    ("154.207.176.0", "154.207.183.255"),
    ("159.20.112.0", "159.20.119.255"),
    ("172.225.119.0", "172.225.119.255"),
    ("178.250.88.0", "178.250.95.255"),
    ("185.18.123.0", "185.18.123.255"),
    ("185.33.60.0", "185.33.63.255"),
]

# انتخاب رنج IP تصادفی
start_ip, end_ip = random.choice(ip_ranges)

# تبدیل آدرس‌ها به مقادیر عددی
start = int(ipaddress.IPv4Address(start_ip))
end = int(ipaddress.IPv4Address(end_ip))

# تولید آدرس IP تصادفی
random_ip = ipaddress.IPv4Address(random.randint(start, end))

# نمایش آدرس IP
print(f"Generated IPv4 is: {random_ip}")
END
